app/Controllers/Main.php

SELECT *
FROM `struktur`
SELECT *
FROM `artikel`
---
    public function homepage()
    {
        $struktur_Data = $this->strukturModel->findAll();
        $kapus = $this->filterData($struktur_Data, "KAPUS", "posisi");
        $katu = $this->filterData($struktur_Data, "KASUBAG TU", "posisi");
        $artikel_data = $this->artikelModel->findAll();

SELECT *
FROM `struktur`
---
    public function structure()
    {
        $struktur_Data = $this->strukturModel->findAll();

SELECT *
FROM `fasilitas`
---
    public function facility()
    {
        $data_facility = $this->fasilitasModel->findAll();

SELECT *
FROM `artikel`
---
    public function article()
    {
        $artikel_data = $this->artikelModel->findAll();